// ConsoleApplication1.16.2.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//Урок 13. Задача 2.

#include <iostream>
#include <locale.h>
#include <vector>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");
	int i, n=1, m=1;
	vector<float>vectPrices(n);
	vector<int>vectPurchases(m);
	cout << "\n Задайте количество ценников на продукты ";
	cin >> n;
	cout << "\n Задайте количество покупок ";
	cin >> m;
	cout <<" vectPrices = {";
	for (i = 0; i < n; i++) {
		
		cout <<" vectPrices[i]=";
cin >> vectPrices[i];
	}
//	 cout<<"}";
//	 cout << "vectPurchases={";
	 for (i = 0; i < m; i++) {
		 cin >> vectPurchases[i];
	}
	//	 cout << "}";
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
