// ConsoleApplication1.16.3.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//Урок 13. Задача 3.

#include <iostream>
#include <locale.h>
#include <vector>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");
	int i, realsize = 0, val=0;
	vector<int>dataBase(21);
    while (val != -2) {
		cout << "\n Введите значения элементов базы данных \n";	
		for (i = 0; i < 21; i++) {
          cin >> val;
		  if ((val != -1) && (val != -2)) {
			  realsize++;
			  if (realsize <= 20) {
				  dataBase[i] = val;		 
			  }
			  else {
				  vector<int>newvect(realsize);
				  int j;
				  for (j = realsize-20; j < realsize; j++) {		 
					  newvect[j] = dataBase[j];			
				  }
				  for (j = 0; j<19 ; j++) {
					  dataBase[j] = newvect[j+1];		
				  }
				  dataBase[19] = val;
                realsize = 20;
			  }
		  }
			else if (val ==-2) {
				cout << "\n Программа завершает работу."; break;
			}
			else if (val == -1) {
			  int j;
			  if (realsize==0) {
                 cout << "\n База данных пуста.";			 
			  }
			  else  {
				  cout << "\n База данных содержит следующие элементы: ";
				  for (j = 0; j < realsize; j++) {
					  cout << dataBase[j] << " ";
				  }
				}	  
		    }
		}
	}
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
